<!-- ...............HTML................ -->
<!DOCTYPE html>
<html> 

<head> 
	<meta http-equiv="content-type" content="text/html; charset=utf-8" />
</head>

<body>

<!-- ........форма1........ -->
<form>
	
	<h1>
	<p align=center>
		Гостевая книга
	</p>
	</h1>

</form>
<!-- ........ ........ -->

<p align=center>
<!-- ...............   ................ -->

<!-- ...............PHP................ -->
<?php
//------------------- вывод текста из файла гостевая книга.txt
$gg = "гостевая книга.txt";
$g = fopen($gg,"r");

if (filesize($gg) == null) { //если в файле ничего нет
	echo "По Вашему запросу ничего не найдено.";
}
  
while(!feof($g)){ 
	echo fgets($g); 
}

fclose($g);
//------------------- 

?>
<!-- ...............   ................ -->

<!-- ...............HTML................ -->
</p>

<!-- ........форма2........ -->
<form form method="post" action="zad5.html">
	
	<p align=center>
		<input type="submit" name="butt2" value="Вернуться на первую страницу" />
	</p>

</form>
<!-- ........ ........ -->

</body>

</html> 
<!-- ...............   ................ -->